{
  "project_id": "97e0dc34-feb9-48ca-a3a3-ba104d9e8203",
  "signal_type": "file_text",
  "source": "manual_upload",
  "raw_text": "Product Requirements Document: The Patel Advisory \"Digital Facilitator\" Platform\n\nExecutive Summary:\nPatel Advisory is transitioning its \"Strategic Assessment & Recommendations\" service from a manual, document-heavy process to a streamlined digital workflow. The goal is to build a \"Digital Facilitator\" platform that standardizes data collection, organizes client information, and facilitates report assembly through structured templates and logic-based workflows.\n\nThe platform will serve as:\n1. A Lead Magnet: A public-facing \"Business Health Pulse\" diagnostic tool to capture prospect data using conditional logic.\n2. A Data Collection Hub: A centralized system for gathering structured data (via surveys) and unstructured data (via transcripts and file uploads).\n3. A Workflow Manager: A project management dashboard to track assessment progress across the 8 specific assessment stages.\n4. A Report Assembler: A builder that compiles collected data, manual consultant notes, and tagged transcript snippets into stage summaries and a final master report.\n\nUser Personas:\n1. The Principal Consultant (Patel - Admin): Expert analyst who needs structured environment to store notes, interview findings, and client documents. Requires \"single source of truth\" for each client engagement.\n\n2. The Client Champion (CEO/Founder): Primary point of contact who needs visibility into project status and a secure place to share sensitive data.\n\n3. The Client Stakeholder (Employee): Interviewee or survey respondent who needs frictionless, mobile-friendly interface for surveys.\n\nKey Features:\n- Lead Magnet with Conditional Logic Form\n- Automated Teaser Report generation\n- Secure Data Room for file uploads\n- Manual Interview Logger with transcript tagging\n- Survey & Polling Engine with skip logic\n- Project Dashboard with stage tracking\n- Report Builder with drag-and-drop synthesis\n- PDF Generation with Table of Contents\n\nAssessment Framework (8 Sections):\n1. Situation Analysis (Company Snapshot, Evolution, Key Observations)\n2. Top-Down Alignment (Vision/Mission Workshop)\n3. Core Values - Culture & Rules of Engagement (Employee Surveys)\n4. Operating Model - Plans, Processes & Cadence (Operational Audit)\n5. People Power - Org, Roles & Succession (Org Chart Review & Interviews)\n6. Recommended Key Strategies (Strategy Synthesis)\n7. Tactical Recommendations by Function (Departmental Deep Dives)\n8. Reporting & Path Forward (Implementation Plan)\n\nTechnical Requirements:\n- Database: Relational DB (SQL) to link Clients, Projects, Sections, and Data Snippets\n- Frontend: React or Angular for responsive Client Portal and Drag-and-Drop Report Builder\n- Security: SOC 2 compliance features (encryption, RBAC) for the Data Room\n- Output: PDF Generation engine supporting high-fidelity print layouts",
  "metadata": {
    "title": "Patel Advisory PRD",
    "authority": "client"
  }
}
